[
  {
    "title": "Me",
      "description": "I needed a portfolio 🧑‍💻to share my projects and get a job, so, you guessed it! This web application is made by me using only HTML, CSS and... C# using Blazor, think about it as React but for .NET and with native web assembly support. It is hosted in GitHub Pages and deployed using GitHub Actions.", 
    "url": "https://jonas1ara.me/"
  },
  {
    "title": "Photos",
      "description": "Tired of being spied on by Meta and its applications, I stopped using Instagram, but I am a big fan of photography, so, I decided to build an application to share my best photos 📸, it is a full stack .NET application using ASP.NET core for backend and Blazor for frontend, it is hosted in Azure and deployed using GitHub Actions.", 
    "url": "https://jonas1ara-photos.azurewebsites.net/"
  },
  {
    "title": "73",
      "description": "I solved the 73 most useful LeetCode problems implemented in C, C++, C# and F#, I committed to myself to share my solutions with the community on X and GitHub. I also wrote three blog post on my blog about my experience, it's crazy to think that I've already reached 103 stars on GitHub. 🤯", 
    "url": "https://github.com/jonas1ara/73"
  },
  {
    "title": "Blog",
      "description": "I built a blog because that's what all nerds do, it's made with Ruby and Jekyll which turned out to be a real gem 💎, I love writing about F#, Memory, Maths and Algorithms.", 
    "url": "https://jonas1ara.github.io/"
  },
  {
    "title": "Fitch",
      "description": "Fitch is a command line system information display utility for Linux systems built with .NET (The utility is the one shown in the GIF on this page), the project was started by a Microsoft employee and I became a contributor, I talked to him and I became a maintainer ⚙️, then I migrated the project to fsprojects so that it has more reach of user and contributors.", 
    "url": "https://github.com/fsprojects/fitch"
  },
  {
    "title": "IPN-CS",
      "description": "I made a repository that covers the entire programming fundamentals course, the algorithms and data structures course and the algorithm analysis and design course of the Interdisciplinary Professional Engineering Unit Tlaxcala campus of the IPN, it is a very extensive project, where one of my first steps in computer science. ❤️", 
    "url": "https://github.com/jonas1ara/IPN-CS"
  }
]
